content-org/blog.org
#+title: Boyang Yan's Blog
#+hugo_base_dir: ~/blog/
#+hugo_section: posts
#+hugo_front_matter_format: yaml

** DONE Virtualize Windows 11 with Proxmox :windows:11:proxmox:pve:
CLOSED: [2021-12-20 Mon 12:37]
:PROPERTIES:
:EXPORT_FILE_NAME: windows11PVE
:EXPORT_OPTIONS: author:nil
:END:
*** Introduction
As Microsoft released Windows 11, it was made clear that TPM 2.0 and Secure boot is no longer optional but mandatory, without these capabilities on the hardware/virtual hardware, Windows 11 refuse to install.


*** Step 1: Download Windows 11 ISO
You can click [[https://www.microsoft.com/software-download/windows11][Here]] for download ISO file.

*** Step 2: Download virtio-win drivers disk
You can click [[https://github.com/virtio-win/virtio-win-pkg-scripts][Here]], download Latest virtio-win ISO.

*** Step 3: Upload Windows 11 ISO and Latest virtio-win ISO to ProxMox
login to ProxMox -> choose Node -> local (pve) -> ISO Images -> Upload

*** Step 4: Create VM
Click *Create VM* -> *General*: name: Windows 11

-> *OS*: choose boot OS: ISO image choose Win11 ISO; Type: Microsoft Windows; Version: 11/2022

-> System: SCSI Controller: VirtIO SCSI
Machine: q35
Qemu Agent: Enable
BIOS: OVMF (UEFI)
Add TPM: Enable Version: v2.0
EFI Storage and TPM Storage *should use same storage*

-> Disks:
Bus/Device: VirtIO Block
Disk size (GiB): 64

-> CPU:
Cores: 2
Type: host

-> Memory:
Memory (MiB): 8192

-> Network:
Bridge: vmbr0
Model: VirtIO (paravirtualized)

OK, we done! However, *Don't Start it*
*** Step 5: Add virtio-win ISO
Hardware -> Add -> CD/DVD Drive -> choose IDE and your downloaded ISO

*** Step 6: Check Boot Order
Options -> Boot Order
Make sure your boot Win11 at the begging

Now, ready to start this VM.

*** Step 6: Start

*** Reference List
1. https://www.youtube.com/watch?app=desktop&v=fupuTkkKPDU
2. https://dannyda.com/2021/10/08/how-to-install-windows-11-on-proxmox-ve-pve-without-workarounds/
